app/controllers/urls_controller.rb

INSERT INTO "urls" ("created_at", "link", "random_string", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 25 Apr 2014 01:48:13 UTC +00:00], ["link", "www.google.com"], ["random_string", "3GZ3xw"], ["updated_at", Fri, 25 Apr 2014 01:48:13 UTC +00:00]]
---
	def create
		@url = Url.create url_params

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def show
		@url = Url.find(params[:id])

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "3"]]
---
	def edit
		@url = Url.find(params[:id])

SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "27"]]
UPDATE "urls" SET "random_string" = $1, "updated_at" = $2 WHERE "urls"."id" = 22  [["random_string", "B0Jylg"], ["updated_at", Fri, 25 Apr 2014 19:13:24 UTC +00:00]]
---
	def update
		@url = Url.find(params[:id])
		@url.update url_params

DELETE FROM "urls" WHERE "urls"."id" = $1  [["id", 3]]
SELECT "urls".* FROM "urls" WHERE "urls"."id" = $1 LIMIT 1  [["id", "3"]]
---
	def destroy
		Url.find(params[:id]).destroy

SELECT "urls".* FROM "urls" WHERE "urls"."random_string" = 'random_string' LIMIT 1
---
	def go #redirects to alternate url
		#find
		@url = Url.find_by random_string: params[:random_string]